Revit 2027 API
Application.CurrentRevitServerAccelerator Property
 Current Revit Server accelerator.
Namespace: Autodesk.Revit.ApplicationServices
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public string CurrentRevitServerAccelerator { get; set; }
Public Property CurrentRevitServerAccelerator As String
	Get
	Set
public:
property String^ CurrentRevitServerAccelerator {
	String^ get ();
	void set (String^ value);
}
member CurrentRevitServerAccelerator : string with get, set
Property Value
String
Exceptions
Exception | Condition
ArgumentException |  When setting this property: The server name can not be used to construct a well formed Uri string.
ArgumentNullException |  When setting this property: A non-optional argument was null
InvalidOperationException |  When setting this property: When setting the value, Revit failed to write current Revit Server accelerator to the user environment.
Remarks
 Revit connects with Revit Server hosts via current Revit Server accelerator. If current Revit Server accelerator is not set, this will be an empty string.
See Also
Reference
Application Class
Autodesk.Revit.ApplicationServices Namespace